senolgulgonul/TangSketch/bsp/hardware/tangsketch/avr/variants/tangnano9k/pins_arduino.h
// pins_arduino.h — Tang Nano 9K pin definitions
#pragma once

// 6 onboard LEDs (active-LOW)
#define LED0  0
#define LED1  1
#define LED2  2
#define LED3  3
#define LED4  4
#define LED5  5
#define LED_BUILTIN  0

// 2 onboard buttons (active-LOW, S1=reset, S2=GPIO)
#define BTN0  0   // S2 button
#define BTN1  1   // (if wired)

#define NUM_DIGITAL_PINS  6
#define NUM_ANALOG_INPUTS 0
